lvx/base/DataProcessors/бит_ПолучениеДанныхРегистровБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПолучениеДанныхРегистровБухгалтерии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗаполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ОперацияБюджетирование</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ОперацияУправленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СозданныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданныйОбъект</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_ОперацияБюджетирование</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_ОперацияУправленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Enums/бит_ВидыПараметровЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПараметровЗапроса</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
					<Comment>Список</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
					<Comment>Выражение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_ПолучениеДанныхРегистровБухгалтерии/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВидыСравнения = бит_МеханизмПолученияДанных.СформироватьСписокВыбораДляОтборовВОтчете("Массив");
	Элементы.ОтборВОтчетеВидСравнения.СписокВыбора.ЗагрузитьЗначения(ВидыСравнения);
	
	ИсточникДанныхТипы = Новый Массив;
	ИсточникДанныхТипы.Добавить(Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных"));
	ИсточникДанныхТипы.Добавить(Тип("СправочникСсылка.бит_ИсточникиДанных"));	
	ТипыИсточниковДанных = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(ИсточникДанныхТипы);
	
	ОписаниеПроизвольногоТипа = бит_ОбщегоНазначения.ОписаниеПроизвольногоТипа();
	
	// Анализ параметров формы.
	Если Параметры.ЭтоЗаполнениеИзДокументаОперации Тогда		
		Параметры.Свойство("ОбъектСистемы", Объект.ОбъектСистемы);
		Если Параметры.Свойство("ИмяОбъектаСистемы") Тогда		
			Объект.ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(Параметры.ИмяОбъектаСистемы);   		
		КонецЕсли;			
		Если ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда		
			Элементы.ОбъектСистемы.ТолькоПросмотр = Истина;
			ОбновитьСтруктуруТаблицыДанных();		
		КонецЕсли; 	
	Иначе
		// Восстановление настроек при необходимости.
		УстановитьЗначенияПоУмолчанию();		
		Если ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда		
			ОбновитьСтруктуруТаблицыДанных();		
		КонецЕсли; 	
	КонецЕсли;        	 
																			   
	Если ЗначениеЗаполнено(Параметры.ДокументЗаполнения) Тогда
		
		Объект.ДокументЗаполнения = Параметры.ДокументЗаполнения;
		ТекстРеквизитов = "Дата";
		МетаОбъект = Объект.ДокументЗаполнения.Метаданные();
		Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаОбъект) Тогда  		  
			ТекстРеквизитов = ТекстРеквизитов + ", Организация";
		КонецЕсли; 		  
		Если бит_РаботаСМетаданными.ЕстьРеквизит("Сценарий", МетаОбъект) Тогда   		  
			ТекстРеквизитов = ТекстРеквизитов + ", Сценарий";
		КонецЕсли; 
		
		ДанныеДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументЗаполнения, ТекстРеквизитов);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеДок);
		ДатаЗаполнения = Объект.ДокументЗаполнения.Дата;		
		   
	Иначе
		Параметры.Свойство("Сценарий",    Объект.Сценарий);
		Параметры.Свойство("Организация", Объект.Организация);
		Параметры.Свойство("ДатаДок",     ДатаЗаполнения)
	КонецЕсли; 
	
	// Режим работы обработки.
	ТекРежим = ?(ЗначениеЗаполнено(Параметры.Режим), Параметры.Режим, "Групповой");
		
	Если ЗначениеЗаполнено(ДатаЗаполнения) Тогда		
		Объект.Период.Вариант 	    = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Объект.Период.ДатаНачала    = НачалоМесяца(ДатаЗаполнения);
		Объект.Период.ДатаОкончания = КонецМесяца(ДатаЗаполнения);		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Период) Тогда	
		Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;		
	КонецЕсли; 
	
	ЗакрыватьПриВыборе = Ложь;
	ЗакрыватьПриЗакрытииВладельца = Истина;

	УстановитьВидимостьПоРежиму(ТекРежим);
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
	УстановитьЗаголовокФормы(Заголовок);

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеПериода" И УникальныйИдентификатор = Параметр Тогда
	
		ПриИзмененииПериода();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	// Безусловное выполнение.
	ОбъектСистемыИзменение(); 
	
	ИзмененыНастройки = Истина;	
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрБухгалтерии"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов", 	 			  СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы", 		  Объект.ОбъектСистемы);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект,
		Элемент, Объект, "ИсточникДанных", ТипыИсточниковДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	ИсточникДанныхИзменение();
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ИсточникДанных.ВыбиратьТип = Истина;
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанные

&НаКлиенте
Процедура ТаблицаДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Исключения = Новый Массив;
	Исключения.Добавить("ТаблицаДанныеВыполнять");
	Исключения.Добавить("ТаблицаДанныеПериод");
	
	Если Исключения.Найти(Поле.Имя) = Неопределено Тогда
		ИмяРеквизита = СтрЗаменить(Поле.Имя, "ТаблицаДанные_","");
		ТекСтрока = Элементы.ТаблицаДанные.ТекущиеДанные;
		ТекЗначение = ТекСтрока[ИмяРеквизита];		
		Если ЗначениеЗаполнено(ТекЗначение) Тогда		
			ПоказатьЗначение(, ТекЗначение);		
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСозданныеОбъекты

&НаКлиенте
Процедура СозданныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле <> Элементы.СозданныеОбъектыВыполнять Тогда
		ТекущиеДанные = Элементы.СозданныеОбъекты.ТекущиеДанные;
		ПоказатьЗначение(, ТекущиеДанные.СозданныйОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборВОтчете
     
&НаКлиенте
Процедура ОтборВОтчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ОтборВОтчете.ТекущиеДанные;	
	Если ТекущаяСтрока.Значение = Неопределено Тогда		
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;		
	Иначе		
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Ложь;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеВидСравненияПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеЗначениеПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПараметры

&НаКлиенте
Процедура ТаблицаПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	 	
	Если НоваяСтрока И НЕ Копирование Тогда  		
		ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение");   			
	КонецЕсли; 
	ПредыдущийВидПараметра = ТекущиеДанные.ВидПараметра;
	ОграничитьОписаниеТиповПараметра();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ИД = Элементы.ТаблицаПараметры.ТекущиеДанные.ПолучитьИдентификатор();
		ИзменитьВидПараметра(ИД);
		ПредыдущийВидПараметра = ТекущиеДанные.ВидПараметра;
		ОграничитьОписаниеТиповПараметра();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;		
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда  		
		СтандартнаяОбработка = Ложь;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение") Тогда		
		Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область РаботаСНастройками

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда	
		ПараметрыФормы.Вставить("СохраненнаяНастройка", ТекущаяНастройка);	
	КонецЕсли; 
												
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПериодом

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериода(Объект, "Период",, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаДанные

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	Если ТаблицаДанные.Количество() = 0 Тогда
		НачатьОтложенноеОбновлениеДанных();
	Иначе	
		Если ПодтверждениеОчисткиДанных() Тогда
        	НачатьОтложенноеОбновлениеДанных();		 	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеУстановитьФлаги(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ТаблицаДанные, "Выполнять", 1, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСнятьФлаги(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ТаблицаДанные, "Выполнять", 0, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ТаблицаДанные, "Выполнять", 2, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	
	ОповеститьОВыбореДанных("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВДокумент(Команда)
	
	ОповеститьОВыбореДанных("Заполнить");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыСозданныеОбъекты

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	НачатьОтложенноеСозданиеДокументов();	
		
КонецПроцедуры

&НаКлиенте
Процедура СозданныеОбъектыУстановитьФлаги(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.СозданныеОбъекты, "Выполнять", 1, Элементы.СозданныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеОбъектыСнятьФлаги(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.СозданныеОбъекты, "Выполнять", 0, Элементы.СозданныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеОбъектыИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.СозданныеОбъекты, "Выполнять", 2, Элементы.СозданныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеОбъектыУдалить(Команда)
	
	Если Объект.СозданныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипИзмененный = ТипЗнч(Объект.СозданныеОбъекты[0].СозданныйОбъект);
	УдалитьСозданныеОбъектыНаСервере();
	
	ОповеститьОбИзменении(ТипИзмененный);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеОбъектыОчистить(Команда)
	
	Если Объект.СозданныеОбъекты.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='Список созданных объектов будет очищен. Продолжить?';
							|en='List of created objects will be cleared. Continue?'");		
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСозданныеОбъектыОчистить", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
						
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик вопроса очистки списка созданных объектов.
//
// Параметры:
//  Ответ.
//  ДопПараметры.
//
&НаКлиенте
Процедура ВопросСозданныеОбъектыОчистить(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.СозданныеОбъекты.Очистить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьПоРежиму(ТекРежим)
	
	ЭтоОдиночный = ВРег(ТекРежим) = ВРег("Одиночный");
	
	// Видимость в зависимости от режима.
	Элементы.ГруппаСозданныеОбъекты.Видимость = НЕ ЭтоОдиночный;
	Если ЭтоОдиночный Тогда
		Элементы.ОсновныеРазделыОбработки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;	
	
	Элементы.ТаблицаДанныеСоздатьДокументы.Видимость = НЕ ЭтоОдиночный;
	Элементы.ТаблицаДанныеГруппаПеренести.Видимость  = ЭтоОдиночный;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка = Неопределено)	
	
	ТекстЗаголовка = НСтр("ru = 'Получение данных регистров бухгалтерии %1'; 
					 	  |en = 'Getting data from accounting registers %1'");
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, "(" + Строка(ТекущаяНастройка) + ")");
	Иначе	
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, "");
	КонецЕсли;
	
	Заголовок = ТекстЗаголовка;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ПолучениеДанныхРегистровБухгалтерии";

КонецФункции

#КонецОбласти

#Область РаботаСНастройками

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки", ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница  		  = Элементы.СтраницаОбработка;
	Элементы.ОсновныеРазделыОбработки.ТекущаяСтраница = Элементы.ГруппаДанные;
	Элементы.ОбновитьДанные.КнопкаПоУмолчанию 		  = Истина;

	Если ИзмененыНастройки Тогда
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Форма.Элементы.ДекорацияИзмененыНастройки.Видимость = Форма.ИзмененыНастройки;
	Форма.Элементы.ТаблицаДанные.Доступность 		 	= НЕ Форма.ИзмененыНастройки;
			
КонецПроцедуры

&НаСервере
Функция НовыеСохраняемыеНастройки()

	НовыеНастройки = Новый Структура;	
	НовыеНастройки.Вставить("ОбъектСистемы",	Справочники.бит_ОбъектыСистемы.ПустаяСсылка());
	НовыеНастройки.Вставить("ИсточникДанных",  	Неопределено);
	НовыеНастройки.Вставить("Период", 			Новый СтандартныйПериод);
	НовыеНастройки.Вставить("ОтборВОтчете", 	Неопределено);
	НовыеНастройки.Вставить("ТаблицаПараметры", Неопределено);
	НовыеНастройки.Вставить("РежимСообщений",   Объект.РежимСообщений);

	Возврат НовыеНастройки;
	
КонецФункции

&НаСервере
Функция СохраняемыеНастройки()

	СохраняемыеНастройки = НовыеСохраняемыеНастройки();
	ЗаполнитьЗначенияСвойств(СохраняемыеНастройки, Объект);
	
	СохраняемыеНастройки.ОтборВОтчете 	  = Новый ХранилищеЗначения(РеквизитФормыВЗначение("ОтборВОтчете"));
	СохраняемыеНастройки.ТаблицаПараметры = Новый ХранилищеЗначения(РеквизитФормыВЗначение("ТаблицаПараметры")); 
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

// Процедура - обработчик  завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекущаяНастройка = Результат;
		УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка);
	КонецЕсли;

КонецПроцедуры
	
// Процедура - обработчик  завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ВыбратьНастройкиЗавершение(Результат, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда        
		ТекущаяНастройка = Результат;
		ПрименитьНастройки(ТекущаяНастройка);
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройки(ВыбраннаяНастройка)

	Если ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		
		ХранилищеНастроек 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбраннаяНастройка, "ХранилищеНастроек");
		СохраненныйНастройки = ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныйНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Объект, СохраненныйНастройки);

			Если СохраненныйНастройки.Свойство("СтандартныйПериод") Тогда
				Объект.Период = СохраненныйНастройки.СтандартныйПериод;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
				Объект.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод); 
			КонецЕсли;
			
			// Обратная совместимость.
			Если ТипЗнч(СохраненныйНастройки.ОтборВОтчете) = Тип("ТаблицаЗначений") Тогда
				СохраненыйОтбор = СохраненныйНастройки.ОтборВОтчете;
			Иначе	
				СохраненыйОтбор = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СохраненныйНастройки.ОтборВОтчете);
			КонецЕсли;
			ЗначениеВРеквизитФормы(СохраненыйОтбор, "ОтборВОтчете");
			
			Если ТипЗнч(СохраненныйНастройки.ТаблицаПараметры) = Тип("ТаблицаЗначений") Тогда
				СохраненыеПараметры = СохраненныйНастройки.ТаблицаПараметры;
			Иначе	
				СохраненыеПараметры = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СохраненныйНастройки.ТаблицаПараметры);
			КонецЕсли;
			ЗначениеВРеквизитФормы(СохраненыеПараметры, "ТаблицаПараметры");
									
			ОбъектСистемыИзменение();
		КонецЕсли;	 
	КонецЕсли; 
	
	УстановитьЗаголовокФормы(Заголовок, ВыбраннаяНастройка);
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры // ПрименитьНастройки()

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованну.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда
		ПрименитьНастройки(НастройкаПоУмолчанию);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.РежимСообщений) Тогда 	
		Объект.РежимСообщений = "Ошибки";	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлементамиШапкиФормы

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбъектСистемыИзменение()
	
	ОбновитьСтруктуруТаблицыДанных();
		
КонецПроцедуры

// Функция проверяет используется ли выбранный регистр.
// 
// Возвращаемое значение:
//  Булево.
// 
&НаСервере
Функция ИсточникПоВыбранномуРегистру()

	РегистрИспользуется = Истина;
	
	Если ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") 
		  И ЗначениеЗаполнено(Объект.ИсточникДанных) Тогда
	
		ТекстЗапроса = Объект.ИсточникДанных.ЗапросБД.ТекстЗапроса;
		
		Если Найти(ТекстЗапроса, Объект.ОбъектСистемы.ИмяОбъекта) = 0 Тогда		
			РегистрИспользуется = Ложь;		
		КонецЕсли; 
	
	КонецЕсли; 

	Возврат РегистрИспользуется;
	
КонецФункции

// Процедура устанавливает значения параметров и значения отборов по определенному имени.
// Используется при открытии из операции для установки отборов по сценарию или организации.
// 
// Параметры:
//  Имя 		   - Строка.
//  ЗначениеОтбора - Произвольный.
// 
&НаСервере
Процедура УстановитьОбязательныеОтборы(Имя, ЗначениеОтбора)
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		
		СтрОтбор    = Новый Структура("ИмяПараметра", Имя);		
		МассивСтрок = ТаблицаПараметры.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл			
			СтрокаТаблицы.ЗначениеПараметра = ЗначениеОтбора;			
		КонецЦикла; 
		
		СтрОтбор    = Новый Структура("Имя", Имя);		
		МассивСтрок = ОтборВОтчете.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл			
			СтрокаТаблицы.Значение = ЗначениеОтбора;
			СтрокаТаблицы.Использование = Истина;			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ИсточникДанныхИзменение()
	
	Если НЕ ИсточникПоВыбранномуРегистру() Тогда		
		ТекстСообщения = НСтр("ru='Выбранный источник ""%1"" не извлекает данные из регистра ""%2"".';
							  |en='The selected source ""%1"" does not retrieve data from the register ""%2"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Объект.ИсточникДанных, Объект.ОбъектСистемы);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;
	
	ЗаполнитьТаблицуОтборов();
	ОбновитьТаблицуПараметров();
	
	УстановитьОбязательныеОтборы("Сценарий",    Объект.Сценарий);
	УстановитьОбязательныеОтборы("Организация", Объект.Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеТаблицыДанных

// Функция запрашивает у пользователя подтверждение на очистку данных.
// 
// Возвращаемое значение:
//  Булево.
// 
&НаКлиенте
Функция ПодтверждениеОчисткиДанных()
	
	Выполнять = Истина;
	
	Если ТаблицаДанные.Количество() > 0  Тогда		
		Выполнять = Ложь;		
		ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеОчисткиДанныхЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);				
	КонецЕсли; 
	
	Возврат Выполнять;
	
КонецФункции

// Процедура обработчик оповещения "ПодтверждениеОчисткиДанныхЗавершение".
// 
// Параметры:
//  Ответ 				 - КодВозвратаДиалога.
//  ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ПодтверждениеОчисткиДанныхЗавершение(Ответ, ДополнительныеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
	     // Выполнение по запросу от пользователя.
		 НачатьОтложенноеОбновлениеДанных();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтложенноеОбновлениеДанных()
	
	Отказ = НЕ ПроверитьЗаполнение();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыНастройки = Ложь;	
	СкрытьНастройки();
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
	ДлительнаяОперация    = НачатьОтложенноеОбновлениеДанныхНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтложенноеОбновлениеДанныхЗавершение", ЭтотОбъект);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОтложенноеОбновлениеДанныхНаСервере()
			
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ВыполняемыйМетод    = "Обработки.бит_ПолучениеДанныхРегистровБухгалтерии.ПолучитьДанные";
	
	ДанныеОбъекта = Новый Структура("ИсточникДанных, Период, НастройкаПулаПодключений");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("ОтборВОтчете", 	 РеквизитФормыВЗначение("ОтборВОтчете"));
	ДанныеФормы.Вставить("ТаблицаПараметры", РеквизитФормыВЗначение("ТаблицаПараметры"));
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
			ДанныеОбъекта, ДанныеФормы);
	
КонецФункции
			
&НаКлиенте
Процедура ОтложенноеОбновлениеДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ОбновлениеДанныхЗавершениеНаСервере(Результат.АдресРезультата);
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ОбновлениеДанныхЗавершениеНаСервере(АдресРезультата)

	ТаблицаДанные.Очистить();
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(АдресРезультата);		
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если ТаблицаРезультат.Количество() = 0 Тогда		
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору';en='No data satisfying the selection'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;

	Для каждого СтрокаТаблицы Из ТаблицаРезультат Цикл	
		НоваяСтрока = ТаблицаДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСтруктурыТаблицыДанных

// Функция возвращает массив имен реквизитов которые всегда присутствуют в таблице данных.
// 
// Возвращаемое значение:
//  ПостоянныеРеквизиты - Массив.
// 
&НаСервере
Функция ПостоянныеРеквизитыТаблицыДанных()

	ПостоянныеРеквизиты = Новый Массив;
	
	ПостоянныеРеквизиты.Добавить("Выполнять");
	ПостоянныеРеквизиты.Добавить("Период");

	Возврат ПостоянныеРеквизиты;
	
КонецФункции

&НаСервере
Процедура УдалитьДинамическиеЭлементы()
	
	ИмяТаблицы = "ТаблицаДанные";
	ПостояннныеРеквизиты = ПостоянныеРеквизитыТаблицыДанных();
	
	// Удаление "динамически созданных" реквизитов.
	МассивРеквизитов = ПолучитьРеквизиты(ИмяТаблицы);
	
	УдаляемыеРеквизиты = Новый Массив;
	Для каждого РеквФормы Из МассивРеквизитов Цикл
		Если ПостояннныеРеквизиты.Найти(РеквФормы.Имя) = Неопределено Тогда
			ПутьКДанным = РеквФормы.Путь + "." + РеквФормы.Имя;
			УдаляемыеРеквизиты.Добавить(ПутьКДанным);
		КонецЕсли; 
	КонецЦикла;
	
	ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
	// Удаление "динамически созданных" элементов управления.	
	УдаляемыеЭлементы = Новый Массив;
	Для каждого ЭлФормы Из Элементы Цикл
		Если ТипЗнч(ЭлФормы) = Тип("ПолеФормы") Тогда
			Если Найти(ЭлФормы.Имя, ИмяТаблицы + "_") > 0  Тогда				
				УдаляемыеЭлементы.Добавить(ЭлФормы);				
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого ЭлФормы Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(ЭлФормы);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОписаниеРеквизита(Имя, Синоним, Тип)

	СтрОписание = Новый Структура;
	СтрОписание.Вставить("Имя",     Имя);
	СтрОписание.Вставить("Синоним", Синоним);
	СтрОписание.Вставить("Тип",     Тип);

	Возврат СтрОписание;
	
КонецФункции

&НаСервере
Процедура ДобавитьНебалансовоеПоле(Коллекция, Мета, ДтКт)
	
	Если Мета <> Неопределено И Мета.Балансовый = Ложь Тогда
		
		ТекОписание = ОписаниеРеквизита(Мета.Имя + ДтКт, Мета.Синоним + " " + ДтКт, Мета.Тип);
		Коллекция.Добавить(ТекОписание);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПолеФормы(Имя, ПутьКДанным, ЭлементКонтейнер = Неопределено)
	
	ЭУ = Элементы.Добавить(Имя, Тип("ПолеФормы"), ЭлементКонтейнер);
	ЭУ.ПутьКДанным = ПутьКДанным;		
	ЭУ.Вид         = ВидПоляФормы.ПолеВвода;
	
	Возврат ЭУ;
	
КонецФункции

// Процедура добавляет реквизиты формы по коллекции регистра.
// 
// Параметры:
//  Коллекция 			  - Массив.
//  ИмяТаблицы 			  - Строка.
//  ЭлементРодитель 	  - ЭлементФормы.
//  ЭлементРодительВторой - ЭлементФормы (По умолчанию = Неопределено).
// 
&НаСервере
Процедура ДобавитьРеквизитыПоКоллекции(Коллекция, ИмяТаблицы, ЭлементРодитель, ЭлементРодительВторой = Неопределено)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для каждого МетаРеквизит Из Коллекция Цикл
		
		НовыйРеквизит = Новый РеквизитФормы(МетаРеквизит.Имя, МетаРеквизит.Тип, ИмяТаблицы, МетаРеквизит.Синоним);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЦикла; 
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	СчетчикКолонок = 1;
	Для каждого МетаРеквизит Из Коллекция Цикл
		
		ИмяЭлемента = ИмяТаблицы + "_" + МетаРеквизит.Имя;
		ПутьКДанным = ИмяТаблицы + "." + МетаРеквизит.Имя;
		
		Если ЭлементРодительВторой <> Неопределено И СчетчикКолонок > 3 Тогда
			ДобавитьПолеФормы(ИмяЭлемента, ПутьКДанным, ЭлементРодительВторой);
		Иначе	
			ДобавитьПолеФормы(ИмяЭлемента, ПутьКДанным, ЭлементРодитель);
		КонецЕсли;
		
		СчетчикКолонок = СчетчикКолонок + 1;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура создает реквизиты и элементы управления таблицы данных 
// в зависимости от выбранного регистра. 
// 
&НаСервере
Процедура ОбновитьСтруктуруТаблицыДанных()

	ТаблицаДанные.Очистить();
	
	УдалитьДинамическиеЭлементы();
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = Объект.ОбъектСистемы.ИмяОбъекта;	
	МетаРегистр = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
	
	МассивБалансовыхИзмерений 	= Новый Массив;
	МассивНеБалансовыхИзмерений = Новый Массив;
	МассивБалансовыхРесурсов 	= Новый Массив;
	МассивНеБалансовыхРесурсов 	= Новый Массив;
	
	ИзмерениеВалюта = Неопределено;
	
	// Измерения.
	Для Каждого ТекущееИзмерение Из МетаРегистр.Измерения Цикл		
		Если ТекущееИзмерение.Балансовый Тогда
			МассивБалансовыхИзмерений.Добавить(ТекущееИзмерение);
		Иначе
			МассивНеБалансовыхИзмерений.Добавить(ТекущееИзмерение);
			
			Если ТекущееИзмерение.Имя = "Валюта" Тогда
				ИзмерениеВалюта = ТекущееИзмерение;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	// Ресурсы.
	Для Каждого ТекущийРесурс Из МетаРегистр.Ресурсы Цикл		
		Если ТекущийРесурс.Балансовый Тогда
			МассивБалансовыхРесурсов.Добавить(ТекущийРесурс);
		Иначе
			МассивНеБалансовыхРесурсов.Добавить(ТекущийРесурс);
		КонецЕсли;		
	КонецЦикла;
	
	ПоддержкаКорреспонденции = МетаРегистр.Корреспонденция;
	
	ПланСчетовРегистра = МетаРегистр.ПланСчетов;
	ТипСчет = Новый ОписаниеТипов("ПланСчетовСсылка." + ПланСчетовРегистра.Имя);
	ТипСубконто = ПланСчетовРегистра.ВидыСубконто.Тип;
	
	МаксКоличествоСубконто = ПланСчетовРегистра.МаксКоличествоСубконто;
	
	ИмяТаблицы = "ТаблицаДанные";
	
	СтороныПроводки = Новый Массив;
	СтороныПроводки.Добавить("Дт");
	СтороныПроводки.Добавить("Кт");
	
	// Балансовые измерения.
	ДобавитьРеквизитыПоКоллекции(МассивБалансовыхИзмерений, ИмяТаблицы, Элементы.ТаблицаДанныеГруппаПериод);
	
	// Счета и небалансовые измерения.
	Для каждого ДтКт Из СтороныПроводки Цикл
		
		Коллекция = Новый Массив;
		
		ТекОписание = ОписаниеРеквизита("Счет"+ДтКт, "Счет "+ДтКт, ТипСчет);
		Коллекция.Добавить(ТекОписание);
		
		Для каждого Мета Из МассивНеБалансовыхИзмерений Цикл
			
			Если Мета.Имя = "Валюта" Тогда				
				Продолжить;				
			КонецЕсли; 		
			
			ТекОписание = ОписаниеРеквизита(Мета.Имя+ДтКт, Мета.Синоним+" "+ДтКт, Мета.Тип);
			Коллекция.Добавить(ТекОписание);
			
		КонецЦикла; 
		
		Группа = Элементы["ТаблицаДанныеГруппаСчет"+ДтКт];
		ДобавитьРеквизитыПоКоллекции(Коллекция, ИмяТаблицы, Группа);
		
	КонецЦикла; // СтороныПроводки
	
	// Субконто
	Для каждого ДтКт Из СтороныПроводки Цикл
		
		Коллекция = Новый Массив;
		
		Для н = 1 По МаксКоличествоСубконто Цикл			
			Имя 		= СтрШаблон("Субконто%1%2", ДтКт, н);
			Синоним 	= СтрШаблон(НСтр("ru='Субконто %1 %2';en='Subconto %1 %2'"), ДтКт, н);
			ТекОписание = ОписаниеРеквизита(Имя, Синоним, ТипСубконто);			
			Коллекция.Добавить(ТекОписание);			
		КонецЦикла; 
		
		Группа = Элементы["ТаблицаДанныеГруппаСубконто"+ДтКт];
		ДобавитьРеквизитыПоКоллекции(Коллекция, ИмяТаблицы, Группа);
		
	КонецЦикла; // СтороныПроводки
	
	// Валюта, валютная сумма, количество
	Для каждого ДтКт Из СтороныПроводки Цикл
	
		Коллекция = Новый Массив;
		
		Мета = МетаРегистр.Ресурсы.Найти("Количество");
		ДобавитьНебалансовоеПоле(Коллекция, Мета, ДтКт);
		Мета = МетаРегистр.Измерения.Найти("Валюта");
		ДобавитьНебалансовоеПоле(Коллекция, Мета, ДтКт);
		Мета = МетаРегистр.Ресурсы.Найти("ВалютнаяСумма");
		ДобавитьНебалансовоеПоле(Коллекция, Мета, ДтКт);
		
		Группа = Элементы["ТаблицаДанныеГруппаВалюта"+ДтКт];
		ДобавитьРеквизитыПоКоллекции(Коллекция, ИмяТаблицы, Группа);
		
	КонецЦикла;  // СтороныПроводки
	
	// Балансовые ресурсы.
	ДобавитьРеквизитыПоКоллекции(МассивБалансовыхРесурсов, ИмяТаблицы, Элементы.ТаблицаДанныеГруппаРесурсы);	
	
	// Небалансовые ресурсы.
	Для каждого ДтКт Из СтороныПроводки Цикл
		
		Коллекция = Новый Массив;
		
		Для каждого Мета Из МассивНеБалансовыхРесурсов Цикл
			
			Если Мета.Имя = "Количество" ИЛИ Мета.Имя = "ВалютнаяСумма" Тогда				
				Продолжить;				
			КонецЕсли; 
			
			ДобавитьНебалансовоеПоле(Коллекция, Мета, ДтКт);
			
		КонецЦикла; 
		
		Группа = Элементы["ТаблицаДанныеГруппаРесурсы"+ДтКт];
		ДобавитьРеквизитыПоКоллекции(Коллекция, ИмяТаблицы, Группа);
		
	КонецЦикла;  // СтороныПроводки
	
	// Реквизиты.
	ДобавитьРеквизитыПоКоллекции(МетаРегистр.Реквизиты, ИмяТаблицы, 
		Элементы.ТаблицаДанныеГруппаРеквизиты, Элементы.ТаблицаДанныеГруппаРеквизиты2);
	
КонецПроцедуры // ОбновитьСтруктуруТаблицыДанных()

#КонецОбласти

#Область РаботаСТаблицейФормыСозданныеОбъекты

&НаСервере
Процедура УдалитьСозданныеОбъектыНаСервере()
	
	Индекс = Объект.СозданныеОбъекты.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТаблицы = Объект.СозданныеОбъекты[Индекс]; 
		
		Если СтрокаТаблицы.Выполнять Тогда
			Попытка
				ДокументОбъект = СтрокаТаблицы.СозданныйОбъект.ПолучитьОбъект();
				ДокументОбъект.Заблокировать();
				ДокументОбъект.УстановитьПометкуУдаления(Истина);				
				Объект.СозданныеОбъекты.Удалить(СтрокаТаблицы);
			Исключение
				ТекстСообщения = НСтр("ru = 'Документ ""%1"" не удалось пометить к удалению. По причине: %2.';
									|en = 'The document ""%1"" could not be marked for deletion. For the reason: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,  СтрокаТаблицы.СозданныйОбъект, 
									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
				Поле = СтрШаблон("СозданныеОбъекты[%1].СозданныйОбъект", Формат(Индекс, "ЧН=0; ЧГ="));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, "Объект");
			КонецПопытки;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОтложенноеСозданиеДокументов

&НаКлиенте
Процедура НачатьОтложенноеСозданиеДокументов()
		
	ДлительнаяОперация    = НачатьОтложенноеСозданиеДокументовНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтложенноеСозданиеДокументовЗавершение", ЭтотОбъект);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОтложенноеСозданиеДокументовНаСервере()
			
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ВыполняемыйМетод    = "Обработки.бит_ПолучениеДанныхРегистровБухгалтерии.СоздатьДокументы";
	
	ДанныеЗаполнения = РеквизитФормыВЗначение("ТаблицаДанные");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
		ДанныеЗаполнения, Объект.ОбъектСистемы, Объект.РежимСообщений);
	
КонецФункции
		
&НаКлиенте
Процедура ОтложенноеСозданиеДокументовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ТипИзмененный = СозданиеДокументовЗавершениеНаСервере(Результат.АдресРезультата);		
		Если ЗначениеЗаполнено(ТипИзмененный) Тогда
			ОповеститьОбИзменении(ТипИзмененный);
		КонецЕсли;		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Функция СозданиеДокументовЗавершениеНаСервере(АдресРезультата)

	ТипИзмененный = Неопределено;
	
	СозданныеДокументы = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если ЗначениеЗаполнено(СозданныеДокументы) Тогда
		
		ТипИзмененный = ТипЗнч(СозданныеДокументы[0]);
		
		Для каждого Элемент Из СозданныеДокументы Цикл
			НоваяСтрока = Объект.СозданныеОбъекты.Добавить();
			НоваяСтрока.СозданныйОбъект = Элемент;
		КонецЦикла;
		
		Элементы.ОсновныеРазделыОбработки.ТекущаяСтраница = Элементы.ГруппаСозданныеОбъекты;
		
		ТекстСообщения = НСтр("ru='Создание документов завершено.';en='Creating documents completed.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	КонецЕсли;
	
	Возврат ТипИзмененный;
	
КонецФункции

#КонецОбласти

#Область РаботаСТаблицейФормыОтборВОтчете

&НаСервере
Процедура ОтборВОтчетеВидСравненияПриИзмененииСервер(Ид)
		
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	

КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеЗначениеПриИзмененииСервер(Ид)
	
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОтборов()

	ТаблицаОтборов = РеквизитФормыВЗначение("ОтборВОтчете");
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(Объект.ИсточникДанных, ТаблицаОтборов);
	ЗначениеВДанныеФормы(ТаблицаОтборов, ОтборВОтчете);	

КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаПараметры

&НаКлиенте
Процедура ОграничитьОписаниеТиповПараметра()

	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда			
		ОписаниеОграничение = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
	Иначе
		Если ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда  		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина; 		
		Иначе	                                                        		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Ложь;  		
		КонецЕсли; 
		
		ДобавляемыеТипы = Новый Массив;
		ДобавляемыеТипы.Добавить(Тип("СписокЗначений"));
		Если ЗначениеЗаполнено(ТекущиеДанные.ДоступныеТипы) Тогда
			ОписаниеОграничение = Новый ОписаниеТипов(ТекущиеДанные.ДоступныеТипы, ДобавляемыеТипы);
		Иначе		
			ОписаниеОграничение = Новый ОписаниеТипов(ОписаниеПроизвольногоТипа, ДобавляемыеТипы);
		КонецЕсли;
	КонецЕсли;	
	
	Элементы.ТаблицаПараметрыЗначениеПараметра.ОграничениеТипа = ОписаниеОграничение;  

КонецПроцедуры

&НаСервере
Процедура ИзменитьВидПараметра(ИД)

	ТекущиеДанные = ТаблицаПараметры.НайтиПоИдентификатору(ИД);
	бит_МеханизмПолученияДанных.ИзменениеВидаПараметра(ТекущиеДанные, ПредыдущийВидПараметра);

КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПараметров()
	
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(Объект.ИсточникДанных, ТаблицаПараметры, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПереносОбъектовИзОбработки

// Функция формирует структуру результата.
// 
// Параметры:
//  Режим - Строка.
//  
// Возвращаемое значение:
//  Струкутура.
// 
&НаСервере
Функция ДанныеДляПередачи(Режим)

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("Режим",     Режим);
	РезСтруктура.Вставить("ИмяКласса", "РезультатПолученияДанных");
	
	МассивСтрок = Новый Массив;
	
	НайденныеСтроки = ТаблицаДанные.НайтиСтроки(Новый Структура("Выполнять", Истина));
    Если НайденныеСтроки.Количество() > 0 Тогда
        РезСтруктура.Вставить("ЕстьДанные", Истина);
		ТабЗнДанные = ТаблицаДанные.Выгрузить(НайденныеСтроки);
    Иначе
        РезСтруктура.Вставить("ЕстьДанные", Ложь);
		ТабЗнДанные = Неопределено;
	КонецЕсли;	
	
	ХранилищеДанные = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТабЗнДанные);
	РезСтруктура.Вставить("ХранилищеДанные", ХранилищеДанные);
		              
	Возврат РезСтруктура;
	
КонецФункции

// Процедура опововещает форму-владельца о выборе данных.
// 
// Параметры:
//  Режим - Строка.
// 
&НаКлиенте
Процедура ОповеститьОВыбореДанных(Режим)

	РезСтруктура = ДанныеДляПередачи(Режим);
	    
    Если РезСтруктура.ЕстьДанные Тогда
        ОповеститьОВыборе(РезСтруктура);
    Иначе	
        ТекстСообщения = НСтр("ru='Нет выбранных данных';en='No Selected Data'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);        	
    КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецОбласти
